openwch/ch32v20x/EVT/EXAM/BLE/BLE_USB/APP/ch32v20x_usbotg_device.c
                                        case 2:
                                            /* USB product string descriptor */
                                            pDescr = StrDesc;
                                            len = StrDesc[0];
                                            break;

                                        default:
                                            errflag = 0xFF;
                                            break;
                                    }
                                    break;

                                case USB_DESCR_TYP_REPORT:
                                    break;

                                case USB_DESCR_TYP_QUALIF:
                                    break;

                                case USB_DESCR_TYP_BOS:
                                    /* BOS descriptor */
                                    /* USB2.0 device does not support the BOS descriptor */
                                    errflag = 0xFF;
                                    break;

                                default:
                                    errflag = 0xff;
                                    break;
                            }

                            if(SetupReqLen > len)
                                SetupReqLen = len;
                            len = (SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : SetupReqLen;
                            memcpy(pEP0_DataBuf, pDescr, len);
                            pDescr += len;
                        }
                        break;

                        case USB_SET_ADDRESS:
                            /* Setting address */
                            SetupReqLen = (pSetupReqPakHD->wValue) & 0xff;
                            break;

                        case USB_GET_CONFIGURATION:
                            /* Get the configuration value */
                            pEP0_DataBuf[0] = DevConfig;
                            if(SetupReqLen > 1)
                                SetupReqLen = 1;
                            break;

                        case USB_SET_CONFIGURATION:
                            /* Set the configuration value */
                            DevConfig = (pSetupReqPakHD->wValue) & 0xff;
                            break;

                        case USB_CLEAR_FEATURE:
                            /* Cleaer feature */
                            if((pSetupReqPakHD->bRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)
                            {
                                /* Clear endpoint */
                                switch((pSetupReqPakHD->wIndex) & 0xff)
                                {
                                    case 0x82:
                                        USBOTG_FS->UEP2_TX_CTRL = (USBOTG_FS->UEP2_TX_CTRL & ~(USBHD_UEP_T_TOG | USBHD_UEP_T_RES_MASK)) | USBHD_UEP_T_RES_NAK;
                                        break;

                                    case 0x02:
                                        USBOTG_FS->UEP2_RX_CTRL = (USBOTG_FS->UEP2_RX_CTRL & ~(USBHD_UEP_R_TOG | USBHD_UEP_R_RES_MASK)) | USBHD_UEP_R_RES_ACK;
                                        break;

                                    case 0x81:
                                        USBOTG_FS->UEP1_TX_CTRL = (USBOTG_FS->UEP1_TX_CTRL & ~(USBHD_UEP_T_TOG | USBHD_UEP_T_RES_MASK)) | USBHD_UEP_T_RES_NAK;
                                        break;

                                    case 0x01:
                                        USBOTG_FS->UEP1_RX_CTRL = (USBOTG_FS->UEP1_RX_CTRL & ~(USBHD_UEP_R_TOG | USBHD_UEP_R_RES_MASK)) | USBHD_UEP_R_RES_ACK;
                                        break;

                                    default:
                                        errflag = 0xFF;
                                        break;
                                }
                            }
                            else
                                errflag = 0xFF;
                            break;

                        case USB_SET_FEATURE:
                            /* Set feature */
                            if((pMySetupReqPakHD->bRequestType & 0x1F) == 0x00)
                            {
                                /* Setting device */
                                if(pMySetupReqPakHD->wValue == 0x01)
                                {
                                    if(MyCfgDescrHD[7] & 0x20)
                                    {
                                        /* Set wake-up enable flag */
                                        USBHD_Dev_SleepStatus = 0x01;
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                            }
                            else if((pMySetupReqPakHD->bRequestType & 0x1F) == 0x02)
                            {
                                /* Set the endpoint */
                                if(pMySetupReqPakHD->wValue == 0x00)
                                {
                                    /* Set the specified endpoint stall */
                                    switch((pMySetupReqPakHD->wIndex) & 0xff)
                                    {
                                        case 0x82:
                                            /* Set endpoint 2 IN STALL */
                                            USBOTG_FS->UEP2_TX_CTRL = (USBOTG_FS->UEP2_TX_CTRL &= ~USBHD_UEP_T_RES_MASK) | USBHD_UEP_T_RES_STALL;
                                            //USBHS->UEP2_CTRL  = ( USBHS->UEP2_CTRL & ~USBHS_EP_T_RES_MASK ) | USBHS_EP_T_RES_STALL;
                                            break;

                                        case 0x02:
                                            /* Set endpoint 2 OUT Stall */
                                            USBOTG_FS->UEP2_RX_CTRL = (USBOTG_FS->UEP2_RX_CTRL &= ~USBHD_UEP_R_RES_MASK) | USBHD_UEP_R_RES_STALL;
                                            //USBHS->UEP2_CTRL  = ( USBHS->UEP2_CTRL & ~USBHS_EP_R_RES_MASK ) | USBHS_EP_R_RES_STALL;
                                            break;

