openwch/ch32v20x/EVT/EXAM/BLE/BLE_USB/APP/ch32v20x_usbotg_device.c
                                        case 0x81:
                                            /* Set endpoint 1 IN STALL */
                                            USBOTG_FS->UEP1_TX_CTRL = (USBOTG_FS->UEP1_TX_CTRL &= ~USBHD_UEP_T_RES_MASK) | USBHD_UEP_T_RES_STALL;
                                            //USBHS->UEP1_CTRL  = ( USBHS->UEP1_CTRL & ~USBHS_EP_T_RES_MASK ) | USBHS_EP_T_RES_STALL;
                                            break;

                                        case 0x01:
                                            /* Set endpoint 1 OUT STALL */
                                            USBOTG_FS->UEP1_RX_CTRL = (USBOTG_FS->UEP1_RX_CTRL &= ~USBHD_UEP_R_RES_MASK) | USBHD_UEP_R_RES_STALL;
                                            //USBHS->UEP1_CTRL  = ( USBHS->UEP1_CTRL & ~USBHS_EP_R_RES_MASK ) | USBHS_EP_R_RES_STALL;
                                            break;

                                        default:
                                            errflag = 0xFF;
                                            break;
                                    }
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                            }
                            else
                            {
                                errflag = 0xFF;
                            }
                            break;

                        case USB_GET_INTERFACE:
                            /* Obtain interface */
                            pEP0_DataBuf[0] = 0x00;
                            if(SetupReqLen > 1)
                                SetupReqLen = 1;
                            break;

                        case USB_SET_INTERFACE:
                            /* Set interface */
                            EP0_DatabufHD[0] = 0x00;
                            if(USBHD_Dev_SetupReqLen > 1)
                            {
                                USBHD_Dev_SetupReqLen = 1;
                            }
                            break;

                        case USB_GET_STATUS:
                            /* Reply according to the actual state of the current endpoint */
                            EP0_DatabufHD[0] = 0x00;
                            EP0_DatabufHD[1] = 0x00;
                            if(pMySetupReqPakHD->wIndex == 0x81)
                            {
                                if((USBOTG_FS->UEP1_TX_CTRL & USBHD_UEP_T_RES_MASK) == USBHD_UEP_T_RES_STALL)
                                {
                                    EP0_DatabufHD[0] = 0x01;
                                }
                            }
                            else if(pMySetupReqPakHD->wIndex == 0x01)
                            {
                                if((USBOTG_FS->UEP1_RX_CTRL & USBHD_UEP_R_RES_MASK) == USBHD_UEP_R_RES_STALL)
                                {
                                    EP0_DatabufHD[0] = 0x01;
                                }
                            }
                            else if(pMySetupReqPakHD->wIndex == 0x82)
                            {
                                if((USBOTG_FS->UEP2_TX_CTRL & USBHD_UEP_T_RES_MASK) == USBHD_UEP_T_RES_STALL)
                                {
                                    EP0_DatabufHD[0] = 0x01;
                                }
                            }
                            else if(pMySetupReqPakHD->wIndex == 0x02)
                            {
                                if((USBOTG_FS->UEP2_RX_CTRL & USBHD_UEP_R_RES_MASK) == USBHD_UEP_R_RES_STALL)
                                {
                                    EP0_DatabufHD[0] = 0x01;
                                }
                            }
                            if(USBHD_Dev_SetupReqLen > 2)
                            {
                                USBHD_Dev_SetupReqLen = 2;
                            }
                            break;

                        default:
                            errflag = 0xff;
                            break;
                    }
                }
                if(errflag == 0xff)
                {
                    USBOTG_FS->UEP0_TX_CTRL = USBHD_UEP_T_TOG | USBHD_UEP_T_RES_STALL;
                    USBOTG_FS->UEP0_RX_CTRL = USBHD_UEP_R_TOG | USBHD_UEP_R_RES_STALL;
                }
                else
                {
                    if(chtype & 0x80)
                    {
                        len = (SetupReqLen > DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : SetupReqLen;
                        SetupReqLen -= len;
                    }
                    else
                        len = 0;

                    USBOTG_FS->UEP0_TX_LEN = len;
                    USBOTG_FS->UEP0_TX_CTRL = USBHD_UEP_T_TOG | USBHD_UEP_T_RES_ACK;
                    USBOTG_FS->UEP0_RX_CTRL = USBHD_UEP_R_TOG | USBHD_UEP_R_RES_ACK;
                }
                break;

            case USBHD_UIS_TOKEN_IN:
                switch(USBOTG_FS->INT_ST & (USBHD_UIS_TOKEN_MASK | USBHD_UIS_ENDP_MASK))
                {
                    case USBHD_UIS_TOKEN_IN:
                        switch(SetupReqCode)
                        {
                            case USB_GET_DESCRIPTOR:
                                len = SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : SetupReqLen;
                                memcpy(pEP0_DataBuf, pDescr, len);
                                SetupReqLen -= len;
                                pDescr += len;
                                USBOTG_FS->UEP0_TX_LEN = len;
                                USBOTG_FS->UEP0_TX_CTRL ^= USBHD_UEP_T_TOG;
                                break;

                            case USB_SET_ADDRESS:
                                USBOTG_FS->DEV_ADDR = (USBOTG_FS->DEV_ADDR & USBHD_UDA_GP_BIT) | SetupReqLen;
                                USBOTG_FS->UEP0_TX_CTRL = USBHD_UEP_T_RES_NAK;
                                USBOTG_FS->UEP0_RX_CTRL = USBHD_UEP_R_RES_ACK;
                                break;

                            default:
                                USBOTG_FS->UEP0_TX_LEN = 0;
                                USBOTG_FS->UEP0_TX_CTRL = USBHD_UEP_T_RES_NAK;
                                USBOTG_FS->UEP0_RX_CTRL = USBHD_UEP_R_RES_ACK;
                                break;
                        }
                        break;
                        /* Back to NCK by default */
                    case USBHD_UIS_TOKEN_IN | 1:
                        USBOTG_FS->UEP1_TX_CTRL ^= USBHD_UEP_T_TOG;
                        USBOTG_FS->UEP1_TX_CTRL = (USBOTG_FS->UEP1_TX_CTRL & ~USBHD_UEP_T_RES_MASK) | USBHD_UEP_T_RES_NAK;
                        break;

                    case USBHD_UIS_TOKEN_IN | 2:

                        USBOTG_FS->UEP2_TX_CTRL ^= USBHD_UEP_T_TOG;
                        USBOTG_FS->UEP2_TX_CTRL = (USBOTG_FS->UEP2_TX_CTRL & ~USBHD_UEP_T_RES_MASK) | USBHD_UEP_T_RES_NAK;
                        break;

